Revit 2027 API
BuiltInFailures.SketchFailures.OpenLoopError Property
 Lines must be in closed loops. The highlighted lines are open on one end.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenLoopError { get; }
Public Shared ReadOnly Property OpenLoopError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenLoopError {
	FailureDefinitionId^ get ();
}
static member OpenLoopError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace